PSI/Notes.org
#+TITLE: Professional Skills and Issues
#+Author: Alistair Johnston
#+Description: PSI Notes
#+STARTUP: showeverything
#+OPTIONS: toc

* Professional Skills and Issues

** Risk & Responsibility
Relevant concepts and legal aspects around risk & responsibility.
 - The Risk & Responsibility theme considers the following material:
 - Professional bodies
 - Display Screen Regulations
 - Risk
 - Consultancy and contract hire
 - Contracts
 - Security through contracts
 - Defective software
 - Computer Misuse
 - Plan, Do, Check, Act

*** Professional bodies
Professional bodies
 - Professionals (e.g., architects, engineers, medics) must accept responsibility for their actions, especially when a mistake could be disastrous.
 - A professional body is an organisation that promotes high standards in a particular profession. 

Examples of IT-related professional bodies:
 - ACM (US-based but international membership)
 - BCS (UK)
 - IEEE (US-based but international membership; electrical/telecommunications/computer engineering)
 - IET (UK; electrical/computer engineering)

 - Each professional body publishes a code of conduct, and requires its members to adhere to it.
 - The professional body can suspend or expel members for serious breaches of its code of conduct.
 - In some professions (e.g., medicine), suspension or expulsion entails loss of the right to practice.
 - In software engineering, this is not (yet) the case.

**** ACM
***** GENERAL ETHICAL PRINCIPLES.
 - Contribute to society and to human well-being, acknowledging that all people are stakeholders in computing.
 - Avoid harm.
 - Be honest and trustworthy.
 - Be fair and take action not to discriminate.
 - Respect the work required to produce new ideas, inventions, creative works, and computing artifacts.
 - Respect privacy.
 - Honor confidentiality.

***** PROFESSIONAL RESPONSIBILITIES.
 - Strive to achieve high quality in both the processes and products of professional work.
 - Maintain high standards of professional competence, conduct, and ethical practice.
 - Know and respect existing rules pertaining to professional work.
 - Accept and provide appropriate professional review.
 - Give comprehensive and thorough evaluations of computer systems and their impacts, including analysis of possible risks.
 - Perform work only in areas of competence.
 - Foster public awareness and understanding of computing, related technologies, and their consequences.
 - Access computing and communication resources only when authorized or when compelled by the public good.
 - Design and implement systems that are robustly and usably secure.

***** PROFESSIONAL LEADERSHIP PRINCIPLES.
 - Ensure that the public good is the central concern during all professional computing work.
 - Articulate, encourage acceptance of, and evaluate fulfillment of social responsibilities by members of the organization or group.
 - Manage personnel and resources to enhance the quality of working life.
 - Articulate, apply, and support policies and processes that reflect the principles of the Code.
 - Create opportunities for members of the organization or group to grow as professionals.
 - Use care when modifying or retiring systems.
 - Recognize and take special care of systems that become integrated into the infrastructure of society.

***** COMPLIANCE WITH THE CODE.
 - Uphold, promote, and respect the principles of the Code.
 - Treat violations of the Code as 

**** BCS
1. You make IT for everyone
2. Show what you know, learn what you don't
3. Respect the organisation or individual you work for
4. Keep IT real. Keep IT professional. Pass IT on

**** IEEE
***** To uphold the highest standards of integrity, responsible behavior, and ethical conduct in professional activities.
 - To hold paramount the safety, health, and welfare of the public, to strive to comply with ethical design and sustainable development practices, to protect the privacy of others, and to disclose promptly factors that might endanger the public or the environment;
 - To improve the understanding by individuals and society of the capabilities and societal implications of conventional and emerging technologies, including intelligent systems;
 - To avoid real or perceived conflicts of interest whenever possible, and to disclose them to affected parties when they do exist;
 - To avoid unlawful conduct in professional activities, and to reject bribery in all its forms;
 - To seek, accept, and offer honest criticism of technical work, to acknowledge and correct errors, to be honest and realistic in stating claims or estimates based on available data, and to credit properly the contributions of others;
 - To maintain and improve our technical competence and to undertake technological tasks for others only if qualified by training or experience, or after full disclosure of pertinent limitations;

***** To treat all persons fairly and with respect, to not engage in harassment or discrimination, and to avoid injuring others.
 - To treat all persons fairly and with respect, and to not engage in discrimination based on characteristics such as race, religion, gender, disability, age, national origin, sexual orientation, gender identity, or gender expression;
 - To not engage in harassment of any kind, including sexual harassment or bullying behavior;
 - To avoid injuring others, their property, reputation, or employment by false or malicious actions, rumors or any other verbal or physical abuses;

