PSI/Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-04 Mon 10:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Professional Skills and Issues</title>
<meta name="author" content="Alistair Johnston" />
<meta name="description" content="PSI Notes" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Professional Skills and Issues</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3274210">1. Professional Skills and Issues</a>
<ul>
<li><a href="#orga282dd1">1.1. Risk &amp; Responsibility</a>
<ul>
<li><a href="#org0d488aa">1.1.1. Professional bodies</a></li>
<li><a href="#orgdf7bb74">1.1.2. Display Screen Equipment</a></li>
<li><a href="#orgb41296e">1.1.3. Risk</a></li>
<li><a href="#orgbaa539a">1.1.4. Consultancy and contract hire</a></li>
<li><a href="#orgbe34579">1.1.5. Contracts</a></li>
<li><a href="#orgc1e51af">1.1.6. Security through contracts</a></li>
<li><a href="#orgb6ab49b">1.1.7. Defective software</a></li>
<li><a href="#org0195b1f">1.1.8. Computer Misuse</a></li>
<li><a href="#org220a4c9">1.1.9. Plan, Do, Check, Act</a></li>
</ul>
</li>
<li><a href="#org18ca6fb">1.2. Platforms &amp; Profit</a>
<ul>
<li><a href="#org379de76">1.2.1. Intellectual Property Rights</a></li>
<li><a href="#org1e7cc79">1.2.2. Copyright</a></li>
<li><a href="#orgcd4d2d5">1.2.3. Confidentiality</a></li>
<li><a href="#org47efe79">1.2.4. Patents</a></li>
<li><a href="#org923d893">1.2.5. Trade marks</a></li>
<li><a href="#orgeffb4d5">1.2.6. Trade secrets</a></li>
<li><a href="#orge36b5e0">1.2.7. Reverse engineering</a></li>
<li><a href="#orge831d5b">1.2.8. Software locks</a></li>
<li><a href="#org288d703">1.2.9. Software licences</a></li>
</ul>
</li>
<li><a href="#org0a91e27">1.3. Decisions &amp; Discrimination</a>
<ul>
<li><a href="#org9782765">1.3.1. Profiling</a></li>
<li><a href="#orgfe08269">1.3.2. Automated decision-making</a></li>
</ul>
</li>
<li><a href="#org881b302">1.4. Society &amp; Surveillance</a>
<ul>
<li><a href="#org5eed318">1.4.1. Overview</a></li>
<li><a href="#orgf33154d">1.4.2. Privacy</a></li>
<li><a href="#org859da04">1.4.3. Data Protection Legislation</a></li>
<li><a href="#org9baf5e0">1.4.4. General Data Protection Regulations</a></li>
<li><a href="#org49b7f2a">1.4.5. Monitoring of communications</a></li>
<li><a href="#org5296870">1.4.6. Freedom of information</a></li>
<li><a href="#org8d95405">1.4.7. Information Security</a></li>
<li><a href="#orgd70f604">1.4.8. Defamation</a></li>
<li><a href="#org39f8da5">1.4.9. Pornography</a></li>
<li><a href="#orgfff233a">1.4.10. Spam</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3274210" class="outline-2">
<h2 id="org3274210"><span class="section-number-2">1.</span> Professional Skills and Issues</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga282dd1" class="outline-3">
<h3 id="orga282dd1"><span class="section-number-3">1.1.</span> Risk &amp; Responsibility</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Relevant concepts and legal aspects around risk &amp; responsibility.
</p>
<ul class="org-ul">
<li>The Risk &amp; Responsibility theme considers the following material:</li>
<li>Professional bodies</li>
<li>Display Screen Regulations</li>
<li>Risk</li>
<li>Consultancy and contract hire</li>
<li>Contracts</li>
<li>Security through contracts</li>
<li>Defective software</li>
<li>Computer Misuse</li>
<li>Plan, Do, Check, Act</li>
</ul>
</div>
<div id="outline-container-org0d488aa" class="outline-4">
<h4 id="org0d488aa"><span class="section-number-4">1.1.1.</span> Professional bodies</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Professional bodies
</p>
<ul class="org-ul">
<li>Professionals (e.g., architects, engineers, medics) must accept responsibility for their actions, especially when a mistake could be disastrous.</li>
<li>A professional body is an organisation that promotes high standards in a particular profession.</li>
</ul>

<p>
Examples of IT-related professional bodies:
</p>
<ul class="org-ul">
<li>ACM (US-based but international membership)</li>
<li>BCS (UK)</li>
<li>IEEE (US-based but international membership; electrical/telecommunications/computer engineering)</li>
<li>IET (UK; electrical/computer engineering)</li>

<li>Each professional body publishes a code of conduct, and requires its members to adhere to it.</li>
<li>The professional body can suspend or expel members for serious breaches of its code of conduct.</li>
<li>In some professions (e.g., medicine), suspension or expulsion entails loss of the right to practice.</li>
<li>In software engineering, this is not (yet) the case.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org87572e6"></a>ACM<br />
<ol class="org-ol">
<li><a id="orgd6a8bd6"></a>GENERAL ETHICAL PRINCIPLES.<br />
<div class="outline-text-6" id="text-1-1-1-1-1">
<ul class="org-ul">
<li>Contribute to society and to human well-being, acknowledging that all people are stakeholders in computing.</li>
<li>Avoid harm.</li>
<li>Be honest and trustworthy.</li>
<li>Be fair and take action not to discriminate.</li>
<li>Respect the work required to produce new ideas, inventions, creative works, and computing artifacts.</li>
<li>Respect privacy.</li>
<li>Honor confidentiality.</li>
</ul>
</div>
</li>
<li><a id="orgbcd774e"></a>PROFESSIONAL RESPONSIBILITIES.<br />
<div class="outline-text-6" id="text-1-1-1-1-2">
<ul class="org-ul">
<li>Strive to achieve high quality in both the processes and products of professional work.</li>
<li>Maintain high standards of professional competence, conduct, and ethical practice.</li>
<li>Know and respect existing rules pertaining to professional work.</li>
<li>Accept and provide appropriate professional review.</li>
<li>Give comprehensive and thorough evaluations of computer systems and their impacts, including analysis of possible risks.</li>
<li>Perform work only in areas of competence.</li>
<li>Foster public awareness and understanding of computing, related technologies, and their consequences.</li>
<li>Access computing and communication resources only when authorized or when compelled by the public good.</li>
<li>Design and implement systems that are robustly and usably secure.</li>
</ul>
</div>
</li>
<li><a id="orgce4f491"></a>PROFESSIONAL LEADERSHIP PRINCIPLES.<br />
<div class="outline-text-6" id="text-1-1-1-1-3">
<ul class="org-ul">
<li>Ensure that the public good is the central concern during all professional computing work.</li>
<li>Articulate, encourage acceptance of, and evaluate fulfillment of social responsibilities by members of the organization or group.</li>
<li>Manage personnel and resources to enhance the quality of working life.</li>
<li>Articulate, apply, and support policies and processes that reflect the principles of the Code.</li>
<li>Create opportunities for members of the organization or group to grow as professionals.</li>
<li>Use care when modifying or retiring systems.</li>
<li>Recognize and take special care of systems that become integrated into the infrastructure of society.</li>
</ul>
</div>
</li>
<li><a id="org7a59449"></a>COMPLIANCE WITH THE CODE.<br />
<div class="outline-text-6" id="text-1-1-1-1-4">
<ul class="org-ul">
<li>Uphold, promote, and respect the principles of the Code.</li>
<li>Treat violations of the Code as</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="orga0bb1df"></a>BCS<br />
<div class="outline-text-5" id="text-1-1-1-2">
<ol class="org-ol">
<li>You make IT for everyone</li>
<li>Show what you know, learn what you don't</li>
<li>Respect the organisation or individual you work for</li>
<li>Keep IT real. Keep IT professional. Pass IT on</li>
</ol>
</div>
</li>
<li><a id="org60a1260"></a>IEEE<br />
<ol class="org-ol">
<li><a id="orgab53828"></a>To uphold the highest standards of integrity, responsible behavior, and ethical conduct in professional activities.<br />
<div class="outline-text-6" id="text-1-1-1-3-1">
<ul class="org-ul">
<li>To hold paramount the safety, health, and welfare of the public, to strive to comply with ethical design and sustainable development practices, to protect the privacy of others, and to disclose promptly factors that might endanger the public or the environment;</li>
<li>To improve the understanding by individuals and society of the capabilities and societal implications of conventional and emerging technologies, including intelligent systems;</li>
<li>To avoid real or perceived conflicts of interest whenever possible, and to disclose them to affected parties when they do exist;</li>
<li>To avoid unlawful conduct in professional activities, and to reject bribery in all its forms;</li>
<li>To seek, accept, and offer honest criticism of technical work, to acknowledge and correct errors, to be honest and realistic in stating claims or estimates based on available data, and to credit properly the contributions of others;</li>
<li>To maintain and improve our technical competence and to undertake technological tasks for others only if qualified by training or experience, or after full disclosure of pertinent limitations;</li>
</ul>
</div>
</li>
<li><a id="org7c6b821"></a>To treat all persons fairly and with respect, to not engage in harassment or discrimination, and to avoid injuring others.<br />
<div class="outline-text-6" id="text-1-1-1-3-2">
<ul class="org-ul">
<li>To treat all persons fairly and with respect, and to not engage in discrimination based on characteristics such as race, religion, gender, disability, age, national origin, sexual orientation, gender identity, or gender expression;</li>
<li>To not engage in harassment of any kind, including sexual harassment or bullying behavior;</li>
<li>To avoid injuring others, their property, reputation, or employment by false or malicious actions, rumors or any other verbal or physical abuses;</li>
</ul>
</div>
</li>
