PSI/Notes.org
***** To strive to ensure this code is upheld by colleagues and co-workers.
 - To support colleagues and co-workers in following this code of ethics, to strive to ensure the code is upheld, and to not retaliate against individuals reporting a violation.

*** Display Screen Equipment
'Display Screen' - Just means a Monitor or equivalent

Regulations apply to DSE users
 - DSE users are employees that use display screen equipment continuously for an hour or more in a single working day.

Regulations do not apply to employees that use DSE for short periods of time or use it infrequently.

Display Screen Equipment (DSE) are equipment or devices that contains or includes a display.
 - Alphanumeric display
 - Graphical display
 - Laptops
 - Touch screens.

DSE users are exposed to potential health risks
 - Fatigue
 - Eye strain
 - Sore limbs or back ache

Employees can be exposed to such risks through DSE devices and equipment.
 - Overuse
 - Improper use
 - Badly designed workstations
 - Poorly developed environments

Employers can work with DSE users to avoid potential health risks.
 - Identify risks
 - Develop and implement practical controls
 - Commit to healthy working.

Employers should consult and communicate with DSE regards issues as well as providing relevant information.

Employers should consider:
 - Special requirements of the employee.
 - Role of employee or task being performed.
 - Environment, not just the DSE itself.

Employers do not need to ask employees to assess risk for temporary home working, but employees should inform employers of any discomfort.

Employers should support employees in conducting complete risk assessments for long-term or permanent home working arrangements.

Regulations operate from the premise that DSE work will not result in permanent damage to eyesight or eyes. 

DSE users can request eye tests, employers are expected to provide tests and supply eyewear (if necessary for DSE work). 

Employers may dictate that employees access a nominated optician or they may opt to allow employees to provide bill for expense. 

Employers under the regulations, must:
 - Analyse workstations and assess as well as reduce risk.
 - Ensure appropriate controls are in place.
 - Ensure employees have sufficient information and training.
 - Provide eyesight tests upon request, special eyewear if required.
 - Review the assessment.

Employers must assess risk when:
 - DSE user complain.
 - DSE user commences a new role/position.
 - Environmental change impacts interaction with DSE.
 - New DSE is provided to employee.

DSE assessment must be reviewed, when:
 - Users change workstations.
 - The nature of work tasks changes considerably.
 - The current controls in place may be producing problems for the user.
 - Significant changes occur to the equipment, environment or system.

Health and Safety Executive provide the DSE workstation checklist.

The checklist supports organisations in completing a risk assessment and complying with the legislation.

The DSE checklist assessment outlines a number of risks and other factors.
 - Keyboards, mouse and trackballs.
 - Display screens.
 - Software considerations.
 - Furniture.
 - Environment. 

*** Risk
Risk Management
 - Activities used to coordinate efforts and employees with regards to risk.
 - Risk management process should be built atop a framework and principles.
 - Framework should supporting integrating the risk management process itself in the management processes for an enterprise.

Outcomes of Risk Management
 - Intolerable risk, elements need to abandoned, replaced or evolved to reduce vulnerabilities. 
 - Tolerable risk, risks have been reduced using solutions to as long as reasonably possible (ALARP).
 - Acceptable risk, risk reduction not needed - upside risk that companies not only accept but embrace.

Risk types
 - Routine risks, normal decision process that make use of statistics and data to inform decisions.
 - Complex risks, less obvious may need to gather more evidence and perform cost analysis. 
 - Uncertain risks, lack of predictability and need to monitor impact and roll back any solutions.
 - Ambiguous risks, stakeholders interpret risk differently, need to ensure participatory decision making. 

*** Consultancy and contract hire
Contract hire: A supplier provides a customer with the services of an agreed number of staff for an agreed period at agreed rates.
 - The customer is responsible for managing the staff.
 - The supplier is responsible only for providing staff with the right competences.

Freelancers are individuals who contract out their own services; this is a special case of contract hire.
Consultants are experts who are contracted to advise customers on their operations or projects; this is up-market contract hire.
Contract-hire and consultancy contracts are much simpler than bespoke software contracts.

They should address:
 - IPR (Intellectual Property Rights)
 - Confidentiality
 - Terms of reference
 - Liability (is the customer or supplier responsible for any loss?)

*** Contracts
A contract is an agreement between two or more parties that can be enforced in court.
 - The contract may be verbal or written.
 - The parties may be individuals or organisations.
 - All parties must be competent to make a contract.
 - Each party must receive something and provide something.

Until recently, existing contract law was adequate to cover contracts for supply of computer hardware and software.
But e-commerce needs new legal provisions, to cover transactions where the buyer and seller are in different countries.

