PSI/Notes.html
<li><a id="org1e0e418"></a>To strive to ensure this code is upheld by colleagues and co-workers.<br />
<div class="outline-text-6" id="text-1-1-1-3-3">
<ul class="org-ul">
<li>To support colleagues and co-workers in following this code of ethics, to strive to ensure the code is upheld, and to not retaliate against individuals reporting a violation.</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgdf7bb74" class="outline-4">
<h4 id="orgdf7bb74"><span class="section-number-4">1.1.2.</span> Display Screen Equipment</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
'Display Screen' - Just means a Monitor or equivalent
</p>

<p>
Regulations apply to DSE users
</p>
<ul class="org-ul">
<li>DSE users are employees that use display screen equipment continuously for an hour or more in a single working day.</li>
</ul>

<p>
Regulations do not apply to employees that use DSE for short periods of time or use it infrequently.
</p>

<p>
Display Screen Equipment (DSE) are equipment or devices that contains or includes a display.
</p>
<ul class="org-ul">
<li>Alphanumeric display</li>
<li>Graphical display</li>
<li>Laptops</li>
<li>Touch screens.</li>
</ul>

<p>
DSE users are exposed to potential health risks
</p>
<ul class="org-ul">
<li>Fatigue</li>
<li>Eye strain</li>
<li>Sore limbs or back ache</li>
</ul>

<p>
Employees can be exposed to such risks through DSE devices and equipment.
</p>
<ul class="org-ul">
<li>Overuse</li>
<li>Improper use</li>
<li>Badly designed workstations</li>
<li>Poorly developed environments</li>
</ul>

<p>
Employers can work with DSE users to avoid potential health risks.
</p>
<ul class="org-ul">
<li>Identify risks</li>
<li>Develop and implement practical controls</li>
<li>Commit to healthy working.</li>
</ul>

<p>
Employers should consult and communicate with DSE regards issues as well as providing relevant information.
</p>

<p>
Employers should consider:
</p>
<ul class="org-ul">
<li>Special requirements of the employee.</li>
<li>Role of employee or task being performed.</li>
<li>Environment, not just the DSE itself.</li>
</ul>

<p>
Employers do not need to ask employees to assess risk for temporary home working, but employees should inform employers of any discomfort.
</p>

<p>
Employers should support employees in conducting complete risk assessments for long-term or permanent home working arrangements.
</p>

<p>
Regulations operate from the premise that DSE work will not result in permanent damage to eyesight or eyes. 
</p>

<p>
DSE users can request eye tests, employers are expected to provide tests and supply eyewear (if necessary for DSE work). 
</p>

<p>
Employers may dictate that employees access a nominated optician or they may opt to allow employees to provide bill for expense. 
</p>

<p>
Employers under the regulations, must:
</p>
<ul class="org-ul">
<li>Analyse workstations and assess as well as reduce risk.</li>
<li>Ensure appropriate controls are in place.</li>
<li>Ensure employees have sufficient information and training.</li>
<li>Provide eyesight tests upon request, special eyewear if required.</li>
<li>Review the assessment.</li>
</ul>

<p>
Employers must assess risk when:
</p>
<ul class="org-ul">
<li>DSE user complain.</li>
<li>DSE user commences a new role/position.</li>
<li>Environmental change impacts interaction with DSE.</li>
<li>New DSE is provided to employee.</li>
</ul>

<p>
DSE assessment must be reviewed, when:
</p>
<ul class="org-ul">
<li>Users change workstations.</li>
<li>The nature of work tasks changes considerably.</li>
<li>The current controls in place may be producing problems for the user.</li>
<li>Significant changes occur to the equipment, environment or system.</li>
</ul>

<p>
Health and Safety Executive provide the DSE workstation checklist.
</p>

<p>
The checklist supports organisations in completing a risk assessment and complying with the legislation.
</p>

<p>
The DSE checklist assessment outlines a number of risks and other factors.
</p>
<ul class="org-ul">
<li>Keyboards, mouse and trackballs.</li>
<li>Display screens.</li>
<li>Software considerations.</li>
<li>Furniture.</li>
<li>Environment.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb41296e" class="outline-4">
<h4 id="orgb41296e"><span class="section-number-4">1.1.3.</span> Risk</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Risk Management
</p>
<ul class="org-ul">
<li>Activities used to coordinate efforts and employees with regards to risk.</li>
<li>Risk management process should be built atop a framework and principles.</li>
<li>Framework should supporting integrating the risk management process itself in the management processes for an enterprise.</li>
</ul>

<p>
Outcomes of Risk Management
</p>
<ul class="org-ul">
<li>Intolerable risk, elements need to abandoned, replaced or evolved to reduce vulnerabilities.</li>
<li>Tolerable risk, risks have been reduced using solutions to as long as reasonably possible (ALARP).</li>
<li>Acceptable risk, risk reduction not needed - upside risk that companies not only accept but embrace.</li>
</ul>

<p>
Risk types
</p>
<ul class="org-ul">
<li>Routine risks, normal decision process that make use of statistics and data to inform decisions.</li>
<li>Complex risks, less obvious may need to gather more evidence and perform cost analysis.</li>
<li>Uncertain risks, lack of predictability and need to monitor impact and roll back any solutions.</li>
<li>Ambiguous risks, stakeholders interpret risk differently, need to ensure participatory decision making.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbaa539a" class="outline-4">
<h4 id="orgbaa539a"><span class="section-number-4">1.1.4.</span> Consultancy and contract hire</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Contract hire: A supplier provides a customer with the services of an agreed number of staff for an agreed period at agreed rates.
</p>
<ul class="org-ul">
<li>The customer is responsible for managing the staff.</li>
<li>The supplier is responsible only for providing staff with the right competences.</li>
</ul>

<p>
Freelancers are individuals who contract out their own services; this is a special case of contract hire.
Consultants are experts who are contracted to advise customers on their operations or projects; this is up-market contract hire.
Contract-hire and consultancy contracts are much simpler than bespoke software contracts.
</p>

<p>
They should address:
</p>
<ul class="org-ul">
<li>IPR (Intellectual Property Rights)</li>
<li>Confidentiality</li>
<li>Terms of reference</li>
<li>Liability (is the customer or supplier responsible for any loss?)</li>
</ul>
</div>
</div>
<div id="outline-container-orgbe34579" class="outline-4">
<h4 id="orgbe34579"><span class="section-number-4">1.1.5.</span> Contracts</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
A contract is an agreement between two or more parties that can be enforced in court.
</p>
<ul class="org-ul">
<li>The contract may be verbal or written.</li>
<li>The parties may be individuals or organisations.</li>
<li>All parties must be competent to make a contract.</li>
<li>Each party must receive something and provide something.</li>
</ul>

<p>
Until recently, existing contract law was adequate to cover contracts for supply of computer hardware and software.
But e-commerce needs new legal provisions, to cover transactions where the buyer and seller are in different countries.
</p>
</div>
<ol class="org-ol">
