PSI/Notes.org
**** Bespoke software development contracts
Bespoke software is developed by a supplier for the exclusive use of one customer (or a consortium of customers).
The contract specifies the requirements and all deliverables (software, documentation, training, etc.).

Problem:
 - Requirements are always changing.
 - A contract is supposed to be definitive.

So the contract should explicitly allow for changing requirements at a price.
The contract should also define the customer’s and supplier’s IPR.

Copyright can apply only to code specifically developed for the customer:
 - Not to open-source code
 - Not to standard library code
 - Not to generic code previously developed by the supplier
 - Not to boilerplate code.

The contract might state that the supplier retains copyright but licences the customer to use it (perhaps exclusively).
The contract should state how the development project will be managed.
Each party should nominate a project manager, with authority to make decisions (including financial decisions up to some stated limit).

The contract should specify surcharges if:
 - The customer is late in providing resources or information to the supplier
 - The customer changes the requirements at a late stage.

The contract should specify an acceptance procedure:
 - The customer must provide a set of test cases.
 - If the system performs these test cases correctly, it is accepted.

**** Fixed-price contract
A fixed-price contract specifies exactly what the customer will pay, except for penalty clauses:
 - Increasing the price if the customer is at fault (e.g., changing requirements)
 - Decreasing the price if the supplier is at fault (e.g., unmet requirements, or late delivery).

**** Cost-plus contract
A cost-plus contract specifies that the customer will pay the supplier’s actual costs plus a profit margin.

Why consider a cost-plus contract?
 - The supplier might be unwilling to undertake a fixed-price contract if the requirements are unclear.
 - In a fixed-price contract, the supplier will add in a contingency allowance, which the customer must pay regardless.

*** Security through contracts
Contracts can be utilised as an approach to ensure security standards or specific security requirements.
Enterprises and other companies may rely on other partners or an extensive supply chain.
Legal forms could include specific conditions, warranties and/or third-party certification.
Caution should be exercised that enforcement may be prohibitive or costly.
 - At least by considering such requirements companies will need to perform due diligence that will still benefit the organisation.

**** Payment platforms
Payment or trading platforms effectively represent a closed club where membership is maintained via contract.

Members must adhere to various rules surrounding many aspects of transactions.
 - Duration and timing of transactions.
 - Equipment utilised.
 - Authentication protocols.

The platforms ensure standards and specifications via contracts, members must comply to ensure successful transactions and to collect payment.
The contracts utilised by payment platforms will typically reflect national and international rules and regulations.

Failure to comply, may result in failure to collect payment.
 - If a member fails to comply with the contract when conducting a transaction, for example not adhering to security standards, they may jeopardise payment.

The payment or trading platform could deny payment, even if a transaction has completed, if requirements of the contract have not been met.
 - Member of the club uses the platform to attain payment for sale and delivery of goods.
 - Customer pays for goods, payment collected via platform, member delivers goods to customer.
 - Payment platform refuses to transfer money due to some failure in compliance during the transaction.

**** Payment Card Industry Data Security Standard (PCI DSS)
Designed and developed to ensure consistent and secure use of cardholder data.
Entitles that collect, store, process and transmit cardholder data typically need comply to the standard.
PCI DSS is a standard, not a law and so compliance is typically attained through contracts and other agreements.
 - Laws are still relevant, cardholder data is considered personal data and so in some cases data protections laws may be violated, e.g. data breach.
 - For example: data breach involving cardholder data could result in fines under the PCI DSS and GDPR.

**** PCI DSS Six Control Objectives
Build and Maintain Secure Network and Systems.
 - Vendor supplied system configuration and defaults must not be used.

Protect Cardholder Data.
 - Encrypt transmission of cardholder data and protect it.

Maintain Vulnerability Management Programme.
 - Regularly update anti-virus software.

Implement Strong Access Control Measures.
 - Restrict access to ‘need-to-know-basis’ and restrict physical access.

Regularly Monitor and Test Networks.
 - Track and monitor cardholder data across network resources.

Maintain an Information Security Policy.
 - Develop and refine security policy for staff and contractors.

**** PCI DSS versus Law
PCI DSS is a standard, not a law and so compliance is typically attained through contracts and other agreements.
 - Laws are still relevant, cardholder data is considered personal data and so in some cases data protections laws may be violated, e.g. data breach.
 - For example: data breach involving cardholder data could result in fines under the PCI DSS and GDPR.

PCI DSS has specific truncation rules for the display of the primary account number (PAN) on receipts.
 - “3.3 Mask PAN when displayed (the first six and last four digits are the maximum number of digits to be displayed), such that only personnel with a legitimate business need can see more than the first six/last four digits of the PAN.”

**** US Fair and Accurate Credit Transactions Act (FACTA) 2003
Federal law designed to reduce identity fraud and providing citizens greater insight into their credit profile.

Section 113 outlines specific truncation rules regarding the display of the primary account number (PAN) on receipts.
 - “G(1) Except as otherwise provided in this subsection, no person that accepts credit cards or debit cards for the transaction of business shall print more than the last 5 digits of the card number or the expiration date upon any receipt provided to the cardholder at the point of the sale or transaction.”

**** Example: Microsoft Store
Carlo Guarisma sued Microsoft for providing excessive information on receipts from the Microsoft Store in Aventura Florida.

The receipt from the store contained the customer’s name, salesperson and 10-digits from the payment card (the first six digits and the last four digits).

Microsoft were aligned with the DSS, but not with the law.
 - PCI DSS also has additional caveats though, including that the standard does not supersede law and recall, there “must be a legitimate business need.”

