PSI/Notes.html
<li><a id="org8bd088d"></a>Bespoke software development contracts<br />
<div class="outline-text-5" id="text-1-1-5-1">
<p>
Bespoke software is developed by a supplier for the exclusive use of one customer (or a consortium of customers).
The contract specifies the requirements and all deliverables (software, documentation, training, etc.).
</p>

<p>
Problem:
</p>
<ul class="org-ul">
<li>Requirements are always changing.</li>
<li>A contract is supposed to be definitive.</li>
</ul>

<p>
So the contract should explicitly allow for changing requirements at a price.
The contract should also define the customer’s and supplier’s IPR.
</p>

<p>
Copyright can apply only to code specifically developed for the customer:
</p>
<ul class="org-ul">
<li>Not to open-source code</li>
<li>Not to standard library code</li>
<li>Not to generic code previously developed by the supplier</li>
<li>Not to boilerplate code.</li>
</ul>

<p>
The contract might state that the supplier retains copyright but licences the customer to use it (perhaps exclusively).
The contract should state how the development project will be managed.
Each party should nominate a project manager, with authority to make decisions (including financial decisions up to some stated limit).
</p>

<p>
The contract should specify surcharges if:
</p>
<ul class="org-ul">
<li>The customer is late in providing resources or information to the supplier</li>
<li>The customer changes the requirements at a late stage.</li>
</ul>

<p>
The contract should specify an acceptance procedure:
</p>
<ul class="org-ul">
<li>The customer must provide a set of test cases.</li>
<li>If the system performs these test cases correctly, it is accepted.</li>
</ul>
</div>
</li>
<li><a id="org865571d"></a>Fixed-price contract<br />
<div class="outline-text-5" id="text-1-1-5-2">
<p>
A fixed-price contract specifies exactly what the customer will pay, except for penalty clauses:
</p>
<ul class="org-ul">
<li>Increasing the price if the customer is at fault (e.g., changing requirements)</li>
<li>Decreasing the price if the supplier is at fault (e.g., unmet requirements, or late delivery).</li>
</ul>
</div>
</li>
<li><a id="org5c57fee"></a>Cost-plus contract<br />
<div class="outline-text-5" id="text-1-1-5-3">
<p>
A cost-plus contract specifies that the customer will pay the supplier’s actual costs plus a profit margin.
</p>

<p>
Why consider a cost-plus contract?
</p>
<ul class="org-ul">
<li>The supplier might be unwilling to undertake a fixed-price contract if the requirements are unclear.</li>
<li>In a fixed-price contract, the supplier will add in a contingency allowance, which the customer must pay regardless.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc1e51af" class="outline-4">
<h4 id="orgc1e51af"><span class="section-number-4">1.1.6.</span> Security through contracts</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
Contracts can be utilised as an approach to ensure security standards or specific security requirements.
Enterprises and other companies may rely on other partners or an extensive supply chain.
Legal forms could include specific conditions, warranties and/or third-party certification.
Caution should be exercised that enforcement may be prohibitive or costly.
</p>
<ul class="org-ul">
<li>At least by considering such requirements companies will need to perform due diligence that will still benefit the organisation.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgb993d47"></a>Payment platforms<br />
<div class="outline-text-5" id="text-1-1-6-1">
<p>
Payment or trading platforms effectively represent a closed club where membership is maintained via contract.
</p>

<p>
Members must adhere to various rules surrounding many aspects of transactions.
</p>
<ul class="org-ul">
<li>Duration and timing of transactions.</li>
<li>Equipment utilised.</li>
<li>Authentication protocols.</li>
</ul>

<p>
The platforms ensure standards and specifications via contracts, members must comply to ensure successful transactions and to collect payment.
The contracts utilised by payment platforms will typically reflect national and international rules and regulations.
</p>

<p>
Failure to comply, may result in failure to collect payment.
</p>
<ul class="org-ul">
<li>If a member fails to comply with the contract when conducting a transaction, for example not adhering to security standards, they may jeopardise payment.</li>
</ul>

<p>
The payment or trading platform could deny payment, even if a transaction has completed, if requirements of the contract have not been met.
</p>
<ul class="org-ul">
<li>Member of the club uses the platform to attain payment for sale and delivery of goods.</li>
<li>Customer pays for goods, payment collected via platform, member delivers goods to customer.</li>
<li>Payment platform refuses to transfer money due to some failure in compliance during the transaction.</li>
</ul>
</div>
</li>
<li><a id="org2c00657"></a>Payment Card Industry Data Security Standard (PCI DSS)<br />
<div class="outline-text-5" id="text-1-1-6-2">
<p>
Designed and developed to ensure consistent and secure use of cardholder data.
Entitles that collect, store, process and transmit cardholder data typically need comply to the standard.
PCI DSS is a standard, not a law and so compliance is typically attained through contracts and other agreements.
</p>
<ul class="org-ul">
<li>Laws are still relevant, cardholder data is considered personal data and so in some cases data protections laws may be violated, e.g. data breach.</li>
<li>For example: data breach involving cardholder data could result in fines under the PCI DSS and GDPR.</li>
</ul>
</div>
</li>
<li><a id="orgaf523d0"></a>PCI DSS Six Control Objectives<br />
<div class="outline-text-5" id="text-1-1-6-3">
<p>
Build and Maintain Secure Network and Systems.
</p>
<ul class="org-ul">
<li>Vendor supplied system configuration and defaults must not be used.</li>
</ul>

<p>
Protect Cardholder Data.
</p>
<ul class="org-ul">
<li>Encrypt transmission of cardholder data and protect it.</li>
</ul>

<p>
Maintain Vulnerability Management Programme.
</p>
<ul class="org-ul">
<li>Regularly update anti-virus software.</li>
</ul>

<p>
Implement Strong Access Control Measures.
</p>
<ul class="org-ul">
<li>Restrict access to ‘need-to-know-basis’ and restrict physical access.</li>
</ul>

<p>
Regularly Monitor and Test Networks.
</p>
<ul class="org-ul">
<li>Track and monitor cardholder data across network resources.</li>
</ul>

<p>
Maintain an Information Security Policy.
</p>
<ul class="org-ul">
<li>Develop and refine security policy for staff and contractors.</li>
</ul>
</div>
</li>
<li><a id="orge293f10"></a>PCI DSS versus Law<br />
<div class="outline-text-5" id="text-1-1-6-4">
<p>
PCI DSS is a standard, not a law and so compliance is typically attained through contracts and other agreements.
</p>
<ul class="org-ul">
<li>Laws are still relevant, cardholder data is considered personal data and so in some cases data protections laws may be violated, e.g. data breach.</li>
<li>For example: data breach involving cardholder data could result in fines under the PCI DSS and GDPR.</li>
</ul>

<p>
PCI DSS has specific truncation rules for the display of the primary account number (PAN) on receipts.
</p>
<ul class="org-ul">
<li>“3.3 Mask PAN when displayed (the first six and last four digits are the maximum number of digits to be displayed), such that only personnel with a legitimate business need can see more than the first six/last four digits of the PAN.”</li>
</ul>
</div>
</li>
<li><a id="orgb1b377b"></a>US Fair and Accurate Credit Transactions Act (FACTA) 2003<br />
<div class="outline-text-5" id="text-1-1-6-5">
<p>
Federal law designed to reduce identity fraud and providing citizens greater insight into their credit profile.
</p>

<p>
Section 113 outlines specific truncation rules regarding the display of the primary account number (PAN) on receipts.
</p>
<ul class="org-ul">
<li>“G(1) Except as otherwise provided in this subsection, no person that accepts credit cards or debit cards for the transaction of business shall print more than the last 5 digits of the card number or the expiration date upon any receipt provided to the cardholder at the point of the sale or transaction.”</li>
</ul>
</div>
</li>
<li><a id="org562507f"></a>Example: Microsoft Store<br />
<div class="outline-text-5" id="text-1-1-6-6">
<p>
Carlo Guarisma sued Microsoft for providing excessive information on receipts from the Microsoft Store in Aventura Florida.
</p>

<p>
The receipt from the store contained the customer’s name, salesperson and 10-digits from the payment card (the first six digits and the last four digits).
</p>

<p>
Microsoft were aligned with the DSS, but not with the law.
</p>
<ul class="org-ul">
<li>PCI DSS also has additional caveats though, including that the standard does not supersede law and recall, there “must be a legitimate business need.”</li>
</ul>
</div>
</li>
</ol>
</div>
