PSI/Notes.org
*** Defective software
Video

All software contains faults (bugs).
Software suppliers try to limit their liability for any faults.
Typically:
 - If the software proves to be completely unusable, the supplier agrees to refund the purchase price.
But contract/licence terms attempting to limit liability can be overridden by laws.

**** UK Unfair Contract Terms Act 1977
The UK Unfair Contract Terms Act 1977 makes liability-limiting terms enforceable in law only to the extent that they are reasonable.

A person injured as a result of faulty safety-critical software (or hardware) can sue the supplier for damages, regardless of any limitations stated in the contract/licence.

Even where software is not safety-critical, faults can cause significant economic damage. E.g.:
 - An e-mail client that occasionally loses messages
 - A mapping system that misplaces some commercial properties.

**** UK Sale of Goods Act 1979
The UK Sale of Goods Act 1979 requires that goods sold must be fit for purpose. This applies to retail software.
So a person who buys a software product in a shop but finds that it is seriously faulty, or does not do what it purports to do, can demand a refund.
 - But it is unclear whether this Act applies to software downloaded on the Internet!

*** Computer Misuse
Computer misuse means unauthorised access to any computer.

This can be by any means:
 - Physical access
 - Via the Internet.

This can be for any purpose:
 - curiosity
 - copying, modifying, or deleting data
 - modifying programs
 - disrupting normal operation.

UK computer misuse laws

The Computer Misuse Act 1990 (CMA) was enacted to combat misuse.
 - Note: At that time Internet access was limited.

CMA created three new criminal offences:
 - Unauthorised access to any program/data held in any computer
 - As above, with intent to commit a serious offence
 - Unauthorised modification of the contents of any computer.

CMA applies to:
 - Anyone anywhere who accesses a computer in UK
 - Anyone in UK who accesses a computer anywhere in the world.

Examples of offences:
 - Intentionally spreading a virus or worm
 - Modifying a company’s or individual’s web pages
 - Stealing sensitive personal data (e.g., for publication or blackmail)
 - Stealing commercially sensitive data
 - Disrupting a company’s commercial operations
 - Disrupting operations of an agency concerned with health or safety (e.g., emergency services or air traffic control).

The Police and Justice Act 2006:
 - Increased maximum penalties for CMA offences
 - Amended CMA to cover intent to impair operation of any computer
 - Amended CMA to cover software tools intended to facilitate computer misuse.

New offences:
 - Denial-of-service attacks
 - Building or selling hackers’ toolkits.

Experience of computer misuse laws

Convictions have been infrequent. Penalties have been lenient:
 - Never more than 3 years (even in the NoW phone hacking case)
 - Maximum penalty is 10 years.

Police are over-stretched. To investigate suspected offences, they must engage (expensive) security experts.

Companies that are attacked often prefer to keep quiet, to avoid drawing attention to their security weaknesses.

**** Warranted Activity
Exemption from the CMA and other acts may be permitted if the actions relate to state defence or criminal investigation.
Actions taken that have state authorisation, e.g. warrant, would be exempted from specific laws.
Liability for actions may be exempted to the extent that is expressed by the state authorisation, i.e. want the warrant permits. 
Example: warrant issued in line with the (UK) Investigatory Powers Act (IPA) 2016 would be exempt from criminal liability under the (UK) Computer Misuse Act (CMA) 1990.


**** Computer Fraud
Computer Fraud and Abuse Act 1986 covers:
 - Unauthorised access to any “protected computer”
 - Distribution of malicious code
 - Denial-of-service attacks
 - Trafficking in passwords.

It is draconian:
 - Penalties for first offences up to 10 years.
 - Penalties for repeat offences up to 20 years.
 - Some offences are treated as terrorism.

In UK, computer fraud is covered by existing anti-fraud laws.

But the Internet makes fraud much easier:
 - Online banking
 - E-commerce.

Also, detection and conviction are harder:
 - Collection and preservation of evidence of computer fraud requires specialised expertise.
 - Trials require specialist experts as witnesses.

*** Plan, Do, Check, Act
General management approach for continuous improvement.
Understand the problem by collecting and analysing data, devise a plan to address it.
Develop a solution to the problem and deploy it, collect measurements to understand effectiveness.
Check that solution actually addresses the perceived problem.
Produce report, communicate changes and identify the next set of problems.

** Platforms & Profit
The Platforms & Profit theme considers the following material:
Intellectual Property Rights
Copyright
Confidentiality
Patents
Trade marks
Trade secrets
Reverse Engineering
Software locks
Software licenses

