PSI/Notes.html
<div id="outline-container-orgb6ab49b" class="outline-4">
<h4 id="orgb6ab49b"><span class="section-number-4">1.1.7.</span> Defective software</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
Video
</p>

<p>
All software contains faults (bugs).
Software suppliers try to limit their liability for any faults.
Typically:
</p>
<ul class="org-ul">
<li>If the software proves to be completely unusable, the supplier agrees to refund the purchase price.</li>
</ul>
<p>
But contract/licence terms attempting to limit liability can be overridden by laws.
</p>
</div>
<ol class="org-ol">
<li><a id="orgd83a631"></a>UK Unfair Contract Terms Act 1977<br />
<div class="outline-text-5" id="text-1-1-7-1">
<p>
The UK Unfair Contract Terms Act 1977 makes liability-limiting terms enforceable in law only to the extent that they are reasonable.
</p>

<p>
A person injured as a result of faulty safety-critical software (or hardware) can sue the supplier for damages, regardless of any limitations stated in the contract/licence.
</p>

<p>
Even where software is not safety-critical, faults can cause significant economic damage. E.g.:
</p>
<ul class="org-ul">
<li>An e-mail client that occasionally loses messages</li>
<li>A mapping system that misplaces some commercial properties.</li>
</ul>
</div>
</li>
<li><a id="org71ac3a6"></a>UK Sale of Goods Act 1979<br />
<div class="outline-text-5" id="text-1-1-7-2">
<p>
The UK Sale of Goods Act 1979 requires that goods sold must be fit for purpose. This applies to retail software.
So a person who buys a software product in a shop but finds that it is seriously faulty, or does not do what it purports to do, can demand a refund.
</p>
<ul class="org-ul">
<li>But it is unclear whether this Act applies to software downloaded on the Internet!</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0195b1f" class="outline-4">
<h4 id="org0195b1f"><span class="section-number-4">1.1.8.</span> Computer Misuse</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
Computer misuse means unauthorised access to any computer.
</p>

<p>
This can be by any means:
</p>
<ul class="org-ul">
<li>Physical access</li>
<li>Via the Internet.</li>
</ul>

<p>
This can be for any purpose:
</p>
<ul class="org-ul">
<li>curiosity</li>
<li>copying, modifying, or deleting data</li>
<li>modifying programs</li>
<li>disrupting normal operation.</li>
</ul>

<p>
UK computer misuse laws
</p>

<p>
The Computer Misuse Act 1990 (CMA) was enacted to combat misuse.
</p>
<ul class="org-ul">
<li>Note: At that time Internet access was limited.</li>
</ul>

<p>
CMA created three new criminal offences:
</p>
<ul class="org-ul">
<li>Unauthorised access to any program/data held in any computer</li>
<li>As above, with intent to commit a serious offence</li>
<li>Unauthorised modification of the contents of any computer.</li>
</ul>

<p>
CMA applies to:
</p>
<ul class="org-ul">
<li>Anyone anywhere who accesses a computer in UK</li>
<li>Anyone in UK who accesses a computer anywhere in the world.</li>
</ul>

<p>
Examples of offences:
</p>
<ul class="org-ul">
<li>Intentionally spreading a virus or worm</li>
<li>Modifying a company’s or individual’s web pages</li>
<li>Stealing sensitive personal data (e.g., for publication or blackmail)</li>
<li>Stealing commercially sensitive data</li>
<li>Disrupting a company’s commercial operations</li>
<li>Disrupting operations of an agency concerned with health or safety (e.g., emergency services or air traffic control).</li>
</ul>

<p>
The Police and Justice Act 2006:
</p>
<ul class="org-ul">
<li>Increased maximum penalties for CMA offences</li>
<li>Amended CMA to cover intent to impair operation of any computer</li>
<li>Amended CMA to cover software tools intended to facilitate computer misuse.</li>
</ul>

<p>
New offences:
</p>
<ul class="org-ul">
<li>Denial-of-service attacks</li>
<li>Building or selling hackers’ toolkits.</li>
</ul>

<p>
Experience of computer misuse laws
</p>

<p>
Convictions have been infrequent. Penalties have been lenient:
</p>
<ul class="org-ul">
<li>Never more than 3 years (even in the NoW phone hacking case)</li>
<li>Maximum penalty is 10 years.</li>
</ul>

<p>
Police are over-stretched. To investigate suspected offences, they must engage (expensive) security experts.
</p>

<p>
Companies that are attacked often prefer to keep quiet, to avoid drawing attention to their security weaknesses.
</p>
</div>
<ol class="org-ol">
<li><a id="org2e45fb4"></a>Warranted Activity<br />
<div class="outline-text-5" id="text-1-1-8-1">
<p>
Exemption from the CMA and other acts may be permitted if the actions relate to state defence or criminal investigation.
Actions taken that have state authorisation, e.g. warrant, would be exempted from specific laws.
Liability for actions may be exempted to the extent that is expressed by the state authorisation, i.e. want the warrant permits. 
Example: warrant issued in line with the (UK) Investigatory Powers Act (IPA) 2016 would be exempt from criminal liability under the (UK) Computer Misuse Act (CMA) 1990.
</p>
</div>
</li>
<li><a id="org66ff67b"></a>Computer Fraud<br />
<div class="outline-text-5" id="text-1-1-8-2">
<p>
Computer Fraud and Abuse Act 1986 covers:
</p>
<ul class="org-ul">
<li>Unauthorised access to any “protected computer”</li>
<li>Distribution of malicious code</li>
<li>Denial-of-service attacks</li>
<li>Trafficking in passwords.</li>
</ul>

<p>
It is draconian:
</p>
<ul class="org-ul">
<li>Penalties for first offences up to 10 years.</li>
<li>Penalties for repeat offences up to 20 years.</li>
<li>Some offences are treated as terrorism.</li>
</ul>

<p>
In UK, computer fraud is covered by existing anti-fraud laws.
</p>

<p>
But the Internet makes fraud much easier:
</p>
<ul class="org-ul">
<li>Online banking</li>
<li>E-commerce.</li>
</ul>

<p>
Also, detection and conviction are harder:
</p>
<ul class="org-ul">
<li>Collection and preservation of evidence of computer fraud requires specialised expertise.</li>
<li>Trials require specialist experts as witnesses.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org220a4c9" class="outline-4">
<h4 id="org220a4c9"><span class="section-number-4">1.1.9.</span> Plan, Do, Check, Act</h4>
<div class="outline-text-4" id="text-1-1-9">
<p>
General management approach for continuous improvement.
Understand the problem by collecting and analysing data, devise a plan to address it.
Develop a solution to the problem and deploy it, collect measurements to understand effectiveness.
Check that solution actually addresses the perceived problem.
Produce report, communicate changes and identify the next set of problems.
</p>
</div>
</div>
</div>
<div id="outline-container-org18ca6fb" class="outline-3">
<h3 id="org18ca6fb"><span class="section-number-3">1.2.</span> Platforms &amp; Profit</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The Platforms &amp; Profit theme considers the following material:
Intellectual Property Rights
Copyright
Confidentiality
Patents
Trade marks
Trade secrets
Reverse Engineering
Software locks
Software licenses
</p>
</div>
