PSI/Notes.org
*** Intellectual Property Rights
Tangible vs intellectual property
You have parked your bike on the campus. Someone else takes it away.
You have been deprived of your bike.
This is theft of tangible property.
You have composed a song, writing down the score and lyrics in your notebook. Someone else looks at the notebook, memorises or copies the song, and publishes it.
You still have the song, but you have been deprived of the right to use or sell it as your own.
You have written a computer program. Someone else copies the program, and uses or sells it.
You still have the program, but you have been deprived of the right to use or sell it as your own.
Intellectual Property
Video Transcript Explanation
These are thefts of intellectual property (IP).
Thefts of IP are covered by special laws, known as intellectual property rights (IPR).
IP is particularly easy to take across national boundaries, so international laws are essential.
This was recognised long ago:
Paris Convention 1883, covering trade marks and patents
Berne Convention 1886, covering copyright.
Most (but not all) countries have signed these conventions.
Intellectual Property Rights are negative rights as they demand someone does not perform an activity.
Registered IPRs are approved or granted by states, typically by some official entity.
patents
trademarks
Unregistered IPRs come into existence and are not approved or granted by states.
Copyright
Public domain, in the context of IPR, essentially means no IPR exists.
Intellectual Property Rights
Intellectual Property Rights are negative rights as they demand someone does not perform an activity.
Registered IPRs are approved or granted by states, typically by some official entity.
patents
trademarks
Unregistered IPRs come into existence and are not approved or granted by states.
Copyright
Public domain, in the context of IPR, essentially means no IPR exists.

**** Types
Copyright: the right to copy documents, images, audio/video recordings, programs.
Obligation of confidence: protection for confidential information received but not intended to be passed on to others.
Patent: a temporary monopoly on exploiting an invention.
Trade mark: a sign intended to identify a particular product.

**** Software as IP
Software systems are expensive to develop, so software is valuable IP.
Software has characteristics different from older forms of IP (documents, images, audio/video recordings, inventions, trade marks).
So existing IP laws had to be extended in the 1980s and 1990s.

*** Copyright
Video Transcript Explanation
In UK, the primary law is the Copyright, Design and Patents Act 1988 (CDPA).
CDPA protects:
original literary, dramatic, musical, and artistic works
sound recordings, films, TV programmes.
Copyright lasts up to 70 years after the author’s death.
CDPA classifies software as a literary work! – Only original code is protected.
Boilerplate code is not protected.
An unregistered right that comes into effect upon the creation of original work.
The scope of copyright is typically restricted to the expression of an idea, not so much the idea itself.
At the turn of the century scope was expanded to permit legal action against interference with measures designed to protect copyright.

**** Copyright ownership
The author owns the copyright, unless the author did the work for his/her employer.
If the author is an independent contractor, he/she owns the copyright unless the contract says otherwise.
The copyright owner has exclusive rights:
to make copies of the work (including download of a web page)
to sell, rent, lend, or give away copies of the work
to adapt the work (including translation to a different language).
Others must seek permission from the copyright owner.
In some cases permission is implicit. (E.g., downloading a web page is permitted, but not storing it permanently.)

*** Confidentiality
Video Transcript Explanation
If someone reveals information obtained under an obligation of confidence, he/she can be sued in a civil court.
Examples:
Employees must not reveal confidential information about their employer’s business.
When a company engages a contractor or consultant, the contract will normally include a confidentiality clause.
When two companies are discussing possible collaboration, they will sign a non-disclosure agreement to protect exchanged information.

**** Public interest disclosure
Sometimes the “public interest” overrides an obligation of confidence. This makes it possible for employees (whistle-blowers) to expose wrong-doing.
The UK Public Interest Disclosure Act 1998 (PIDA) provides protection for whistle-blowers who expose:
criminal offences
failure to comply with legal obligations – danger to health and safety
environmental damage
concealment of the above.
The whistle-blower must first approach the employer, then a professional body or public official (not the media!).

*** Patents
Video Transcript Explanation
A patent is a temporary right for an inventor to prevent others from exploiting his/her invention without permission.
The inventor must apply for a patent to a national patenting office.
If the patent is granted, the details of the invention will be published.
This will enable anyone to exploit the invention after the patent has expired.
In UK, CDPA covers patents. It allows a patent to be granted only if the invention is:
new (not previously disclosed or used publicly) – inventive (non-obvious)
capable of industrial application
not in an excluded area.

The European Patent Convention lists excluded areas:
 - Anything covered by copyright
 - Scientific theories
 - Mathematical methods
 - Methods and programs.

**** Software patents
Nevertheless, the European Patent Office has granted software patents. And individual countries have a variety of policies. Result: confusion!
Arguments for and against software patents:
It is illogical to grant a patent for a hardware device but deny it for a device that uses software to do the same thing.
Patents reward research and development, and encourage investment in novel technologies.
Much software development is done by small companies, who cannot afford to defend patents in court.
In practice, software development has not been inhibited by lack of patents.

*** Trade marks
Video Transcript Explanation
The UK Trade Marks Act 1994 provides protection for trade marks.
It defines a trade mark as:
any sign capable of being represented graphically which is capable of distinguishing goods or services of one undertaking from those of other undertakings. A trade mark may, in particular, consist of words (including personal names), designs, letters, numerals or the shape of goods or their packaging.
Trade marks can be registered with the UK Intellectual Property Office, or its equivalent in other countries.
Selling anything with an unauthorised trade mark is a criminal offence in the countries where it is registered.

