PSI/Notes.html
<li><a id="org123983f"></a>Software trade marks<br />
<div class="outline-text-5" id="text-1-2-5-1">
<p>
Software is now usually distributed without physical packaging.
To protect the producer, the software should display the trade mark prominently whenever it runs.
Selling pirated software that displays the genuine producer’s trade mark is then a criminal offence.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgeffb4d5" class="outline-4">
<h4 id="orgeffb4d5"><span class="section-number-4">1.2.6.</span> Trade secrets</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
Video Transcript Explanation
Trade secrets can be protected indefinitely, as long as they are kept secret.
If such secrets become public, securing a patent is unlikely.
Owners of trade secrets can take legal action
</p>
<ul class="org-ul">
<li>Against those that misappropriate their secrets.</li>
<li>Against those that utilise such secrets, e.g. a third-party.</li>
</ul>

<p>
Trade secrets are typically protected under general tort law.
</p>
<ul class="org-ul">
<li>Valuable information that is not widely known.</li>
<li>Valuable information that delivers benefit to the holder, because it has been kept secret.</li>
</ul>

<p>
Empowering those that have been a reasonable attempt to keep their secrets against those that have utilised, obtained and/or revealed without authorisation.
In the US, there has been increasing legal harmonisation around trade secrets across the country.
The (US) Economic Espionage Act (1996) is designed to counter trade secret theft.
In European law, that has also been increasing legal harmonisation around trade secrets across member states.
Directive 2016/943 on the protection of undisclosed know-how and business information (trade secrets) against their unlawful acquisition, use and disclosure.
Trade secret holders can use a range of tactics to kept information secret, including technology and legal tools.
Legal tools include the use of non-disclosure agreements (though such a tool may not be that effective).
The motivation for favouring trade secrets over patents is that companies can exploit their innovation for an indefinite period of time.
Risk being able to prevent others from exploiting the innovation through reverse engineering.
</p>
</div>
</div>
<div id="outline-container-orge36b5e0" class="outline-4">
<h4 id="orge36b5e0"><span class="section-number-4">1.2.7.</span> Reverse engineering</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
Video Transcript Explanation
Reverse engineering can be considered the lawful approach to obtain trade secrets.
promotes the use of patents if trade secret owners want to secure income.
promotes economic activity through competition and innovation without impacting significantly on the creator.
Misappropriation of trade secrets, using tactics such as bribery or espionage, is not fair game.
Scientific investigation on something purchased publicly to reveal its secrets is generally perceived as acceptable.
Reverse engineering is typically perceived as an accepted practice in IPR, but does differ depending on the form.
</p>

<p>
In European law, software owners are typically permitted to decompile programs to understand and support interoperability.
In United States law, similar software owners are typically permitted to decompile programs to understand and support interoperability.
Permitted ‘tinkering’ also includes fixing bugs, adapting for a platform etc.
</p>
</div>
<ol class="org-ol">
<li><a id="org53e1ab9"></a>Reverse engineering software<br />
<div class="outline-text-5" id="text-1-2-7-1">
<p>
In European law, software owners are typically permitted to decompile programs to understand and support interoperability.
In United States law, similar software owners are typically permitted to decompile programs to understand and support interoperability.
permitted ‘tinkering’ also includes fixing bugs, adapting for a platform etc.
</p>
</div>
</li>
<li><a id="orgd9d81ab"></a>First sale<br />
<div class="outline-text-5" id="text-1-2-7-2">
<p>
The first sale rule can be considered the effective protection of individuals to reverse engineer products.
individuals that have acquired products have the right to modify, use and resell those items.
IP owners can control the first sale, but beyond that IP owners generally lose control of subsequent sales of products.
The first rule has many positive outcomes:
</p>
<ul class="org-ul">
<li>Preservation of products.</li>
<li>Secondary market.</li>
<li>Transaction clarity.</li>
<li>Product innovation.</li>
</ul>
</div>
</li>
<li><a id="org99d6c67"></a>Case study: Game Genie<br />
<div class="outline-text-5" id="text-1-2-7-3">
<p>
Video game cheat cartridge originally created by Codemasters and sold by other companies.
The cartridge made small alterations to video games to support players, e.g. infinite lives.
Nintendo stated that the Game Genie infringed derivative work rights.
cartridge afforded consumers the ability to produce unauthorised derivative works of Nintendo games.
Video game cheat cartridge originally created by Codemasters and sold by other companies.
The cartridge made small alterations to video games to support players, e.g. infinite lives.
Nintendo stated that the Game Genie infringed derivative work rights.
cartridge afforded consumers the ability to produce unauthorised derivative works of Nintendo games.
Court debated whether the cartridge actually produced derivative works as it only interfered or substituted signals from the game cartridge to the system with its own and only under direction of the individual.
Court also felt the number of alterations was small and could be deemed fair use.
Court argued the cartridge did not impact the market for Nintendo games as it only be used in conjunction with the games.
The cartridge itself was also had no value without such games.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orge831d5b" class="outline-4">
<h4 id="orge831d5b"><span class="section-number-4">1.2.8.</span> Software locks</h4>
<div class="outline-text-4" id="text-1-2-8">
<p>
Video Transcript Explanation
The use of software locks or activation process to enable the use of software is not unusual, e.g. license key entry.
Neither is the termination of access or reduce access when individuals to no pay usage fees, e.g. software as a service.
Undisclosed, subsequent and time-based software locks are far more problematic.
preventing use of software after a period without prior notification to the user.
such attempts have been successfully considered as attacks against cyber systems and space.
</p>
</div>
<ol class="org-ol">
<li><a id="org2529cbf"></a>Reverse engineering anti-circumvention solutions<br />
<div class="outline-text-5" id="text-1-2-8-1">
<p>
Reverse engineering technological solutions designed to protect IP is very problematic.
Copyright law has generally evolved to dissuade interference with solutions to protect IP.
In UK law, some exceptions do exist in the CPDA.
exemptions exist for those researching cryptography except on computing programs.
researchers must be careful as exemptions do not come into effect if their actions (performance or dissemination) negatively affect the copyright owner.
no exemptions exist for computer programs.
</p>
</div>
</li>
<li><a id="orgc296d17"></a>Kerchoffs’s Principle<br />
<div class="outline-text-5" id="text-1-2-8-2">
<p>
Every aspect of a cryptosystem should be secure, even if every aspect is known, except the key.
</p>
</div>
</li>
<li><a id="org75f74be"></a>Case study: Volkswagen v Garcia<br />
<div class="outline-text-5" id="text-1-2-8-3">
<p>
engine immobiliser and keys utilise specialised cryptographic hardware, produced under license.
researchers reversed engineered the algorithm and wanted to publish results.
researchers could have purchased car and reversed engineered algorithm using chip-slicing.
researchers instead reversed a third-party software that was used by mechanics for diagnostic purposes.
individuals keen to maintain the trade secret status of their work, sought to prevent researchers from disseminating their work.
Court agreed that researchers could have reversed engineered the algorithm via chip-slicing, this would be fair game.
Court stated that instead the researchers had actually reversed engineered a software product – that was likely itself only created through improper use of trade secrets.
Researchers probably knew or should have known that such a product only existed due to such improper use.
Researchers resolved the issue with the IPR owners and eventually disseminated efforts with work essentially aspects redacted.
</p>
</div>
</li>
</ol>
</div>
