PSI/Notes.org
*** Software licences
Video Transcript Explanation
Buying software is not the same as buying something tangible.
It usually means buying a copy of the software with a licence to use it, subject to terms and conditions:
in particular, restrictions on making further copies of the software.

**** Retail software licences
Retail software is intended for a mass market.
The price is modest (typically up to £500).
The buyer receives one copy of the software with a licence to install it on one computer.
The licence does not cover maintenance or upgrades.
An organisation might prefer to negotiate a bulk licence.
The price is correspondingly higher.
The organisation is entitled to install the software on multiple computers.
The licence might limit the number of installations, or the number of simultaneous users.

**** Corporate software licences
Corporate software is intended for large organisations. The market might be:
thousands for generic software (e.g., customer relation management, human resource management, computer-aided design)
hundreds for more specialised software
tens for highly specialised software
Licence characteristics:
hefty up-front licence fee (typically £10,000 – £1,000,000)
annual maintenance fee (typically 20% of licence fee, or on a scale dependent on volume of usage)
installation, configuration, upgrades, and support are covered.

**** Open-source software licences
Open-source software is distributed as source code.
The price is small (or zero).
Typical licence conditions:
The authors’ names and copyright statement must be retained in the source code.
The source code (perhaps modified) can be reused.
The source code can be re-distributed, but only under identical licence conditions. (In particular, software obtained free cannot be re-sold for profit.)
The Open Software Initiative (OSI) was launched in 1998 to promote software licenced in this way.

**** Free software
Free software is distributed completely free of charge.
The Free Software Foundation was launched by Richard Stallman in 1985 to support the GNU project:
 - A version of Unix
 - A suite of compilers for C, C++, Pascal, Ada, Java, etc. (all using common code generators, and targetable to a variety of platforms)
 - Libraries
 - Utilities
 - GNU Emacs
Linux, developed by Linus Torvalds in 1991, is the superstar of free software
 - runs on more platforms than any other OS.

** Decisions & Discrimination
Overview
The Decisions & Discrimination theme considers the following material:
 - Profiling
 - Automated decision-making
 - Data Protection Impact Assessment
 - Anti-discrimination
 - Web Content Accessibility Guidelines
 - Automated decision-making, Data Protection and Equality

*** Profiling
Video Transcript Explanation
• Profile profiling can be considered as extracting patterns through automated processing of large volumes of personal data using algorithms and mathematical techniques to analyze aspects of individuals. Now these aspects could include elements such as their personality, their habits, their behaviors. These patterns are extracted from this analysis can go on to form profiles and these profiles can be incorporated into decision making.

• Process is by organizations. Now these profiles can be generated from a variety of data sources. Some of these data sources are conventional, were aware of them, such as, say, those on social networks in terms of the messages are individuals post the images they post of who they say. The friends are and what they're doing and what their thoughts are.

It can also include web browsing history and these would probably be more familiar with, but there's also data sources that are busing less conventional, or we may not think of such as video surveillance footage or data taken from sensors and the home or outside in public spaces. And it could also come the home or outside in public spaces. And it could also come from data sources that are being added all the time, so it's important to appreciate all the while we talked about just four data sources there. The data that was able to generate these profiles can come from a wide variety of data sources to make them hopefully more effective.

Now these profiles can be used as part of a decision making
process by organizations to make the sessions about people
and those decisions could be could this person afford alone. It
could also be used to predict behavior as the individual in front
of me going to reoffend. Are we going to commit another crime
if I let it go, or should I hold on to them? And they can also be
used to determine individual preferences. Disaster individual
want to see this at the top of the last versus something else at
the bottom versus another individual now cause in the context
we're talking about profiling encompasses use of personal
data, it comes into scope of data protection legislation and in
the European context that is the general data protection
regulations. Specifically, article four defines profiling as any
form of automated processing of personal data consisting of
the use of personal data to evaluate certain personal aspects
relating to a natural person and particular to analyze or predict
aspects concerning that natural persons performance at work,
economic situation, health, personal preferences, interests,
reliability, behavior, location or movements. We're talking about
an individual versus illegal person, which could be a private
company or an organization so the important point there is that
general cause these profiles can utilize personal data they
enact or common scope of the general data protection
regulations in the European context, and you can appreciate
that because the impact revolve quite serious situations, we
can apply or organization can apply these profiles to make
predictions about individuals that can make this elections that
have impacts on their life in terms of if they get alone. Or if
they're going to go into jail.

• Important point: a profile can be used for more than just
marketing. It can be used for a wide range of tasks.
• Extracting patterns through automated processing of large volumes
of personal data.
of personal data.
• Using algorithms and techniques to analyse aspects of individuals.
• Aspects that include habits, interests, behaviour and personality.
• These patterns form profiles that can then be incorporated into a
decision-making process.

**** Data sources
Organisations can generate these profiles from a range of data
sources, including:
• social networks
• video surveillance
• web browsing history
• Internet of Things

**** Motivation for organisations
Profiles can be utilised as part of the decision making process by
organisations to:
• make decisions about individuals
• anticipate behaviour
• determine individual preferences

**** Applications
• Apply generated profiles to individuals.
• Predict behaviours of an individual.
• Profiles can be used for tasks such as marketing, but also to
support serious decisions.
• Consider the Harm Assessment Risk Tool (HARM) example from
the seminar.

