PSI/Notes.org
*** Automated decision-making
Video Transcript Explanation
• Decision process without human involvement.
• Decision process can rely upon on profiles, inferences and other
data.
• Automated decision-making could use profiling, but not always.
• Automated decision-making can result in more accurate and rapid
decisions.
• Affords rapid decisions that involves analysis of large volumes of
data.
• The decision process is often not transparent to individuals.
• Lack of insight into how data is used to make decisions.
• Impact from automated decisions could have a significant impact
on an individual.

**** Data Protection Impact Assessment
Video Transcript Explanation
• DPIA process is to support organisations in considering and
determining the risks associated with data protection.
• DPIA must consider:
◦ context, scope, nature and purpose of data processing
◦ risks to individuals
◦ mitigation measures for those risks
◦ assess compliance, proportionality and necessity of
processing.
• DPIA is required if you meet the requirements of Article 22.
• DPIA can also be used to determine if processing does come
under Article 22.
• Determine the risks of the profiling and automated decision-making
process and the mitigation to those risks.
• Publish the DPIA, but this is not required.
• If you identify high risks that you can not mitigate then the DPIA
must be submitted to the ICO (in the UK context).
must be submitted to the ICO (in the UK context).
• The ICO can advise of the income, including prohibiting the
intended processing.

**** Anti-discrimination
Video Transcript Explanation
• The (UK) Equality Act 2010 aims to progress equality and protect
the rights of individuals from discrimination.
• The Act incorporates and supersedes many prior pieces of
legislation:
◦ The Equal Pay Act 1970
◦ The Sex Discrimination Act 1975
◦ The Race Relations Act 1976
◦ The Disability Discrimination Act 1995
◦ The Employment Equality (Religion or Belief) Regulations 2003
◦ The Employment Equality (Sexual Orientation) Regulations
2003
◦ The Employment Equality (Age) Regulations 2006
◦ The Equality Act 2006, Part 2
◦ The Equality Act (Sexual Orientation) Regulations 2007
(UK) Equality Act 2010 outlaws discrimination on protected
characteristics
◦ Age; disability; gender reassignment; marriage and civil
partnership; pregnancy and maternity; race, colour, ethnic
origin or nationality; religion or belief; sex; sexual orientation.
• Discrimination can be categorised as direct or indirect.
• Direct discrimination is when an individual is treated differently than
another because of a protected characteristic.
• Indirect discrimination is when a decision for everyone has a
different impact on individuals that share a protected characteristic.
• Discrimination can be permitted under the (UK) Equality Act 2010,
if there is a legitimate reason.
• An individual can justify discrimination under the (UK) Equality Act
2010, if they can demonstrate it is a proportionate means to
achieve a legitimate aim.
• Individuals can test if discrimination is permitted under the (UK)
Equality Act 2010 in court.
Grounds:
 - Sex
 - Race
 - Age
 - Disability

Public Sector Bodies (Websites and Mobile Applications) (No. 2)
Accessibility Regulations 2018
• The regulations require Public Sector Bodies to meet the
requirements of the (UK) Equality Act 2010 in providing reasonable
adjustments for disabled people.
• The expectation is that the regulations can be met by complying
with the Web Content Accessibility Guidelines (WCAG) and
providing an accessibility statement.

**** Avoiding discrimination
• Employers and employee must adhere to the (UK) Equality Act 2010.
• Employers can support employees in attaining the act, via:
◦ policy
◦ effective procedures
◦ training and education.

**** Web Content Accessibility Guidelines
Video Transcript Explanation
• The WCAG are a set of guidelines that are internationally
recognised (ISO/IEC 40500:2012).
• The aim of the guidelines is to ensure that web solutions are
accessible to a wide range of individuals with disabilities.
• The guidelines are defined in such a way that they are not
implementation specific.
Principles
• Perceivable
• Operable
• Understandable
• Robust

**** Automated decision-making, Data Protection and Equality
Video Transcript Explanation
• The (EU/UK) General Data Protection Regulations (GDPR) and
(UK) Data Protection Act 2018 (DPA) regulate processing and
collection of personal data.
• Automated decision-making solutions that utilise personal data
come within the scope of the legislation.
• Automated decision-making solutions may also come with the
scope of the (UK) Equality Act 2010.

**** Data protection
• Systems that do not use personal data, do not come within the
scope of data protection legislation, e.g. prediction of the weather.
• Systems that do use personal data for development, testing and
deployment would come within the scope of data protection
legislation.
Automated decision-making and Data Protection
• Development
• Testing
• Deployment
• Data protection legislation is neutral, there is no implementation or
technology referenced.
• The (EU/UK) GDPR has provisions for:
◦ profiling
◦ automated decision-making
Article 22
• The GDPR restricts the use of solely automated decision-
making that has legal impact or similar significant effect on an
individual.
Solely automated
Data Protection Impact Assessment
Relevant rights
Right to be informed
Right to object
Individual rights
Equality
• The (UK) Equality Act 2010 outlines a number of protected
characteristics.
• Automated decision-making must not result in discrimination that:
◦ produces decisions that result in individuals being treated
different due to a protected characteristic
◦ impact of the decision is different for an individual with a
protected characteristic than to those without.
• Organisations must communicate effectively that decisions do not
discriminate on any of the protected characteristics.

** Society & Surveillance
*** Overview
The Society & Surveillance theme considers the following material:
• Privacy
• Data protection
• General Data Protection Regulations
• Mointoring of communications
• Freedom of information
• Information Security
• Internet
• Defamation
• Pornography
• Spam

