PSI/Notes.org
*** Privacy
• “The right of people to be secure in their persons, houses, papers,
and effects, against unreasonable searches and seizures, shall not
be violated, and no Warrants shall issue, but upon probable cause,
supported by Oath or affirmation, and particularly describing the
place to be searches, and the persons or things to be seized.”
◦ US Constitution, Amendment IV via the Bill of Rights (1791).
• “No one shall be subjected to arbitrary interference with his
privacy, family, home or correspondence, nor to attacks upon his
honour or reputation. Everyone has the right of the protection of
the law against such interference or attacks.”
◦ UN, Universal Declaration of Human Rights, Article 12 (1948).
• “Everyone has the right to respect for his or her private and family
• “Everyone has the right to respect for his or her private and family
life, home and communications.”
◦ EU, Charter of Fundamental Rights, Article 7 (2000).
• UK has no comprehensive privacy law.
• The Data Protection Act 1998 covers stored data, but not
communications.
• The Regulation of Investigatory Powers Act 2000 regulates
monitoring of postal, phone, and computer communications.
Video Transcript Explanation

*** Data Protection Legislation
• EU has sought to harmonise national data protection laws:
◦ European Directive on Data Protection 1995
◦ General Data Protection Regulation (GDPR) 2018
• USA has no comprehensive data protection law, but a patchwork of
state laws and regulations.
• Many other countries have weak data protection laws or none at
all.
• Much potential for conflict:
◦ where data is sent from one country to another
◦ where data is held by multinationals (e.g., Google, Facebook).
• Data Protection Act 1984 protected individuals from misuse of
data by large organisations:
◦ use of inaccurate/incomplete/irrelevant personal data
◦ use of personal data by unauthorised persons
◦ use of personal data for purposes other than those for which it
was collected.
• Data Protection Act 1998 (DPA)
◦ conforms to European Directive on Data Protection 1995
◦ covers Internet data as well as stored data
covers Internet data as well as stored data
◦ no longer assumes that large organisations are the only
possible offenders.
Data Protection Act
Terminology
Principles
Data Protection Act 2018
Video Transcript Explanation

*** General Data Protection Regulations
• The GDPR restricts the use of solely automated decision-
making that has legal impact or similar significant effect on an
individual.
• Solely means the decision making process has no human
involvement and is completely automated.
• The process is still considered solely automated if humans are
involved in the entry of data.
• The process would not be considered solely automated, if the
outcome is considered by a human being as part of the decision
process.
• Human inclusion must be significant to avoid being deemed solely
automated.
• A human must have the potential to consider and alter the decision
before application, rather than just blindly approving automated
decisions.
• An automated decision having legal impact is a decision that
affects the legal rights of an individual.
• A decision that has similar significant effect that impacts on the
individual.
• Automated-decision making is permitted under specific
circumstances.
circumstances.
• Organisations also have additional responsibilities when utilising
automated decision-making.
• Organisations must:
◦ develop processes that allow individuals to exercise rights
◦ put safeguards in place
◦ inform the individual about the use of automated decision- making process and profiling.

*** Monitoring of communications
Video Transcript Explanation
In this context communications include:
• Letters
• Phone calls
• Text messages
• E-mail messages
• Anything posted on a blog or social network

Communications data are defined as:
• Identities of senders and receivers
• Their locations
• Dates and times
• Size or durations
• But not the content of communications

**** UK Regulation of Investigatory Powers Act 2000 (RIPA)
RIPA created a framework for controlling lawful interception of computer/phone/postal communications:
• by specified public agencies (police, intelligence, tax collection), but only for preventing or detecting serious crime

• by communication service providers (CSPs) and employers, but only for specified legitimate reasons

RIPA permits any organisation providing computer/phone services
(e.g. an ISP or employer) to monitor and record users’
communications, for legitimate reasons. Legitimate reasons include:
• ensuring compliance with the organisations regulations and procedures
• upholding standards e.g. calls monitored for training purposes
• preventing or detecting crime e.g. theft, fraud
• investigating/detecting unauthorised use of communication systems

Users must be told that such interceptions may take place.
RIPA permits specified public agencies to intercept communications:
• only for specified purposes, such as preventing/detecting serious crime
• only with a warrant granted by a senior official, identifying the suspect persons or organisations

Originally only police, intelligence, and tax agencies could seek
warrants, was alter extended to numerous other public agencies.

***** Controversy and ruling
RIPA has been criticised by some MPs and campaign groups for excessive intrusion. But has also been critised by intelligence agencies for not going far enough.
Blanket surveillance was ruled illegal by the EU court of justice in 2014:
“The Court takes the view that, by requiring the retention of those
[communications] data and by allowing the competent national
authorities to access those data, the directive interferes in a
particularly serious manner with the fundamental rights to respect for
private life and to the protection of personal data. [...]”

**** UK Investigatory Powers Act
The Investigatory Powers Act 2016 reforms interception of communication:
• brought together all the powers available to intelligence and security services to obtain communications
• refines how these powers are monitored and authorised
• ensures Internet connection records can be retained for law enforcement purposes

*** Freedom of information
Video Transcript Explanation
• The basic principle of freedom of information is that information
held by public bodies should be available to the public (with certain
exceptions).
• Key questions:
◦ Which public bodies should be covered?
◦ Which types of information should be covered? Which should be treated as exceptions?
• The Freedom of Information Act 2000 (FoIA) aimed:
◦ to provide clear rights of access to information held by bodies in the public sector
◦ to enable anyone to apply for access to such information.
• FoIA’s answers to the key questions:
◦ Public bodies include Parliament, all government departments, local authorities, NHS, universities, schools, etc.
◦ Information covered includes printed documents, electronic documents, e-mails, etc. Exceptions include classified documents.
• There’s a potential conflict between FoIA and DPA.
• Responding to FoIA requests can be extremely costly.

*** Information Security

