PSI/Notes.html
<div id="outline-container-org8d95405" class="outline-4">
<h4 id="org8d95405"><span class="section-number-4">1.4.7.</span> Information Security</h4>
<div class="outline-text-4" id="text-1-4-7">
</div>
<ol class="org-ol">
<li><a id="org8e655f5"></a>Obfuscation-based inference controls<br />
<div class="outline-text-5" id="text-1-4-7-1">
<p>
Video Transcript Explanation
• Anonymisation
◦ decoupling identification from information.
◦ achieving anonymisation is extremely difficult.
◦ labelling a data set as anonymised remains unclear.
• Generalisation
◦ reducing the precision of data to reduce the likelihood of informing identity.
◦ example: use of ranges.
• Suppression
◦ suppression information, making fewer data available to attacker to reduce inferences.
◦ example: suppression gender in 50% of data records.
• Dummy addition
◦ adding dummies or fake data points to data sets prior to providing to other party.
◦ example: artificial records.
• Perturbation
◦ adding noise to data to reduce the ability of other party to form inferences.
◦ example: differential privacy.
</p>
</div>
</li>
<li><a id="org21b8f31"></a>Internet<br />
<div class="outline-text-5" id="text-1-4-7-2">
<p>
Video Transcript Explanation
• The Internet’s benefits are well-known:
◦ easy access to data of all types (text, images, video, audio)
◦ easy communication
◦ transcends national boundaries.
• But it also brings risks:
◦ some data might be harmful, even unlawful
◦ communication can be abused (e.g., by criminals and “trolls”)
◦ regulation is difficult (because it transcends boundaries)!
</p>
</div>
</li>
<li><a id="org1380d66"></a>Internet Service Providers (ISPs)<br />
<div class="outline-text-5" id="text-1-4-7-3">
<p>
• An internet service provider (ISP) provides access to the Internet for its customers (organisations and individuals).
• Can an ISP be held responsible for unlawful data up/downloaded by its customers?
• EU law (Directive 2000/31/EC) distinguishes between:
◦ mere conduit
◦ caching
◦ hosting.
• Mere conduit: The ISP simply transmits data up/downloaded by the customer.
◦ Then the ISP is not liable for damages or criminal sanctions.
• Caching: The ISP temporarily stores downloaded data, to speed up future downloading of the same data.
◦ Then the ISP is not liable for damages or criminal sanctions, provided that:
◦ it promptly removes or blocks access to cached data when
informed that the original data had been removed/blocked, or a
court/authority has ordered removal/blocking
◦ etc.
• Hosting: The ISP permanently stores data uploaded by its customers.
◦ Then the ISP is not liable for damages or criminal sanctions, provided that:
◦ it is unaware that unlawful data has been uploaded
◦ it promptly removes/blocks unlawful data as soon as it is discovered
◦ the customer who uploaded unlawful data was not acting on the ISP’s authority
◦ etc.
• When an ISP receives a complaint, how does it judge whether data is unlawful?
• If the complainant is a powerful organisation or individual, the ISP might prefer to play safe.
• Example:
◦ A freelance journalist uploads an article alleging that an arms company is ignoring an international arms embargo.
◦ The arms company claims that this is defamation, and demands that the hosting ISP remove the article.
◦ The ISP cannot evaluate the journalist’s detailed evidence.
◦ The ISP might decide to remove the article, just to avoid time- consuming and expensive legal action.
</p>
</div>
</li>
<li><a id="org75887c6"></a>Internet Watch Foundation (IWF)<br />
<div class="outline-text-5" id="text-1-4-7-4">
<p>
• IWF’s remit includes defamatory material, child abuse images,
unlawful adult material, etc.
• Anyone can report any potentially unlawful content to IWF.
• If IWF judges that the content is unlawful, it informs the local police
(or Interpol) and the hosting ISP.
• If the hosting ISP is outside UK, IWF asks all its member ISPs in
UK to block access to the unlawful content.
• Example:
◦ An arms company submits its claim of defamation to IWF.
◦ IWF experts judge whether the claim is justified or not.
◦ If the claim is held to be unjustified, the ISP can safely disregard it.
</p>
</div>
</li>
<li><a id="orgaa9be83"></a>Law in different countries<br />
<div class="outline-text-5" id="text-1-4-7-5">
<p>
Video Transcript Explanation
• US law on ISPs is much looser than EU law. Liability for hosting is
the same as liability for mere conduit.
• What is unlawful content varies widely from country to country.
• But the Internet transcends national boundaries.
◦ In principle, anyone in country A can access data hosted in
another country B (even if the data is lawful in B but unlawful in
A).
◦ Authoritarian governments often try to block access to
deprecated hosts. But determined users can get round such
blocks.
• Council of Europe has approved a convention that covers:
◦ Child pornography
◦ Criminal copyright infringement
◦ Computer-related fraud
◦ Hacking
◦ Hate material.
• Ratified by 39/51 member countries
◦ Including USA and some other countries outside Europe.
• But USA opted out of the hate material clause
◦ Constitutional right to freedom of speech.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgd70f604" class="outline-4">
<h4 id="orgd70f604"><span class="section-number-4">1.4.8.</span> Defamation</h4>
<div class="outline-text-4" id="text-1-4-8">
<p>
Video Transcript Explanation
• Defamation is communication of a false statement that harms the
reputation of an individual, group, or organisation.
• Some countries (e.g., England) distinguish between:
◦ slander (spoken defamation)
◦ libel (written defamation, including e-mail, blogs, tweets, etc.)
• Other countries (e.g., Scotland) make no such distinction.
• In some countries, criticism of government ministers is treated as defamation.
</p>
</div>
</div>
<div id="outline-container-org39f8da5" class="outline-4">
<h4 id="org39f8da5"><span class="section-number-4">1.4.9.</span> Pornography</h4>
<div class="outline-text-4" id="text-1-4-9">
<p>
Video Transcript Explanation
• Before the Internet, porn was relatively easy to control:
◦ photos and videos recorded on film had to be developed, using specialised equipment
◦ police could raid shops suspected of storing porn.
• Now, porn is very difficult to control:
◦ ubiquitous digital cameras
◦ enormous size of Internet.
• There is a wide variation in laws:
◦ In USA, porn is protected by the constitutional right to freedom
of speech (!).
◦ In Europe, adult porn is usually lawful, provided that it is non-
violent, consensual, and inaccessible to children.
◦ In some other countries, all porn is unlawful (and even nudity or scanty dress).
• But there is one consensus:
In nearly all countries, possessing or communicating child porn is a criminal offence.
</p>
</div>
</div>
<div id="outline-container-orgfff233a" class="outline-4">
<h4 id="orgfff233a"><span class="section-number-4">1.4.10.</span> Spam</h4>
<div class="outline-text-4" id="text-1-4-10">
<p>
Video Transcript Explanation
• Spam is unsolicited e-mail, sent without consent of recipients, and
with no attempt to target only recipients likely to be interested.
• Various purposes:
◦ sales (dubious medications, treatments, investments, etc.)
◦ spreading viruses
◦ fraud or identity theft (attempting to discover private
information).
• In EU law (EC Directive on Privacy and Electronic Communications
2002):
◦ Unsolicited e-mail can be sent to individuals only with prior
consent.
◦ Unsolicited e-mail must not conceal the sender’s true address.
◦ A seller may use e-mail addresses obtained in the normal
course of business, but must make it easy for recipients to
request the seller to stop sending spam.
• Onus is on spammers to seek prior consent.
◦ But does not apply to senders outside EU (90% of all spam).
◦ Also hard to enforce: individuals must take their own action,
even against large companies.
• In US law (CAN-SPAM Act 2003), spam is lawful if:
◦ The recipient has not asked the sender to stop.
◦ The unsolicited e-mail contains a valid e-mail address to
request that the sender to stop.
• This is weaker than EU law:
◦ No prior consent is required.
◦ Onus is on the recipient to respond, but this inadvertently confirms that the recipient’s e-mail address is still valid.
• But US law does have teeth:
◦ ISPs can and do sue spammers for damages.
◦ Spammers have been imprisoned and fined.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alistair Johnston</p>
<p class="date">Created: 2023-12-04 Mon 10:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
